/// msg : "成功"
/// code : 0
/// count : 22
/// data : [{"videoId":"05b4529c-661d-363f-9ff1-51cf551080cd","title":"火影忍者","director":"伊达勇登,村田雅彦,都留稔幸,若林厚史,小坂春女,川口敬一郎","actor":"竹内顺子,杉山纪彰,中村千绘,井上和彦,关俊彦,松本和香子,大塚芳忠,胜生真沙子,柴田秀胜,森久保祥太郎,伊藤健太郎,柚木凉香,小杉十郎太,增川洋一,远近孝一,田村由香里,江原正士,水树奈奈,鸟海浩辅,川田绅司,落合露美,大谷育江,重松朋,下屋则子,飞田展男,石冢运升,浅野真由美,石田彰,加濑康之,朴璐美,中田让治,保志总一朗,神奈延年,三木真一郎,中村大树,家中宏,福田信昭,楠大典,本田贵子,平田广明,津田健次郎,坪井智浩,河野智之,根本圭子,铃木琢磨,小林由美子,津田英三,伊藤和晃,浅井清己,佐佐木望","region":"日本","videoType":"日韩动漫,","descs":"　　十多年前一只拥有巨大威力的妖兽“九尾妖狐”袭击了木叶忍者村，当时的第四代火影拼尽全力，以自己的生命为代价将“九尾妖狐”封印在了刚出生的鸣人身上。木叶村终于恢复了平静，但村民们却把鸣人当成像“九尾妖狐”那样的怪物看待，所有人都疏远他。鸣人自小就孤苦无依，一晃十多年过去了，少年鸣人考入了木叶村的忍者学校，结识了好朋友佐助和小樱。佐助是宇智波家族的传人之一，当他还是小孩的时候他的哥哥——一个已经拥有高超忍术的忍者将他们家族的人都杀死了，然后投靠了一直想将木叶村毁灭的大蛇丸，佐助自小就发誓要超越哥哥，为家族报仇。鸣人他们在忍者学校得到了教官卡卡西的精心指点，在他的帮助下去迎接成长中的一次又一次挑战！","cover":"http://api.pingcc.cn/video/img/火影忍者/火影忍者.jpg","releaseTime":"2002","updateTime":"2022-08-20"},{"videoId":"369a7366-e7aa-39e3-bb57-5426d8f2ca64","title":"火影忍女忍","director":"","actor":"西野翔ShôNishino","region":"日本","videoType":"伦理","descs":"在21世纪初，甚麽是和平?那不过是战争期间的休息而已。自从第二次世界大战後的60年间，日本的东京可算是间谍的天堂。政府初期还没有正式成立对抗间谍的组织，警方只有借助民间力量来应付间谍活动。由于政府希望低调对抗间谍，所以策划了一个由女性主导的秘密行动……有关世代相传的超女忍者秘技，根本不曾在书上记载过，美女在当今败坏的社会中应用忍术，仍然是战无不胜的超级秘技!","cover":"http://api.pingcc.cn/video/img/火影忍女忍/火影忍女忍.jpg","releaseTime":"2007","updateTime":"2022-10-03"},{"videoId":"12740d61-174f-3900-be80-0dee31fe3c07","title":"火影忍者舞台剧","director":"","actor":"","region":"日本","videoType":"","descs":"2.5次元舞台剧10月登陆中国","cover":"http://api.pingcc.cn/video/img/火影忍者舞台剧/火影忍者舞台剧.jpg","releaseTime":"2016","updateTime":"2022-05-05"},{"videoId":"1c17256e-201c-30ee-bd1a-648e144ef129","title":"火影忍者疾风传","director":"伊达勇登,小林治,今千秋,村田雅彦","actor":"竹内顺子,杉山纪彰,中村千绘,井上和彦,关俊彦,松本和香子,大塚芳忠,胜生真沙子,小山力也,日野聪,森久保祥太郎,伊藤健太郎,柚木凉香,小杉十郎太,增川洋一,远近孝一,田村由香里,江原正士,水树奈奈,鸟海浩辅,川田绅司,落合露美,根本圭子,大谷育江,重松朋,下屋则子,飞田展男,石田彰,朴璐美,加濑康之,中田让治,谷育子,石川英郎,檀臣幸,内田直哉,近藤隆,东条加那子,阪口周平,川本克彦,樱井孝宏,寺杣昌纪,土师孝也,堀内贤雄,森田顺平,田中敦子,小山茉美,神奈延年,中村大树,家中宏,福田信昭,楠大典,本田","region":"日本","videoType":"日韩动漫,","descs":"　　疾风传指的是佐助投奔大蛇丸后三年发生的故事，故疾风传也可以理解为《火影忍者》第二部。","cover":"http://api.pingcc.cn/video/img/火影忍者疾风传/火影忍者疾风传.jpg","releaseTime":"2007","updateTime":"2022-08-20"},{"videoId":"99d18a61-7714-3f18-91c5-ec34a60e3263","title":"火影忍者经典战役之卷","director":"","actor":"","region":"日本","videoType":"日韩动漫,未知","descs":"","cover":"http://api.pingcc.cn/video/img/火影忍者经典战役之卷/火影忍者经典战役之卷.jpg","releaseTime":"","updateTime":"2023-10-12"},{"videoId":"b1e61cc6-6281-3ba6-853d-93904b45edfb","title":"博人传火影忍者新时代","director":"阿部记之,山下宏幸","actor":"漩涡博人：三瓶由布子宇智波佐良娜：菊池心巳月：木岛隆一猿飞木叶丸：高","region":"日本","videoType":"动漫","descs":"随着和平的到来而走向近代化的木叶忍者村。高楼林立，巨大显示屏中播放出影像，连结各区域的电车在村里奔驰。虽说是忍者村，但一般民众也增多，忍者的生存方式也在逐渐改变的这个时代——村子的领袖，第七代火影·漩涡鸣人的儿子慕留人，进入了培育忍者的学校“忍者学校”。周围的学生们带着“火影的儿子”这样偏见的目光看待慕留人，但慕留人凭借天生的破天荒性格将这种小事轻松越过！慕留人与新的伙伴相遇，他将如何挑战突然发生的神秘事件？在众人心中如疾风般狂奔的“漩涡慕留人”的物语，现在开始！！","cover":"http://api.pingcc.cn/video/img/博人传火影忍者新时代/博人传火影忍者新时代.jpg","releaseTime":"2017","updateTime":"2022-09-19"},{"videoId":"63107a44-cfc4-39ff-b2a2-4c33f26e8b5d","title":"火影忍者剧场版：终章","director":"小林常夫","actor":"竹内顺子,水树奈奈,福山润,中村千绘,森久保祥太郎,日野聪,石田彰,手冢秀彰,日野由利加,西村知道,江川央生,胜生真沙子,大谷育江,根本圭子,江原正士,关俊彦,伊藤健太郎,柚木凉香,鸟海浩辅,增川洋一,津田英三,浅井清己,落合露美,河野智之,坪井智浩,朝仓荣介,志田有彩,洞内爱,齐藤贵美子,菊池心,桑原由气,竹内荣治,高田里穗,桥爪爱,大桥卓弥,常田真太郎,堀内贤雄,佐佐木望,能登麻美子,杉山纪彰,玄田哲章,井上和彦","region":"日本","videoType":"日韩动漫,","descs":"　　第四次忍界大战结束的两年后，此时此刻的漩涡鸣人（竹内顺子配音）早已成为盖世英雄一般的人物，无论他走到哪里都受到女孩子和小朋友的喜爱与追捧，他似乎也有其享受这样喧嚣欢闹的氛围。与之相对，壁花小姐日向雏田（水树奈奈配音）则始终站在角落里，默默注视着这个她喜欢了多年的男孩子。雏田亲手为鸣人织了围巾，怎奈无法鼓足勇气交给对方，喜欢的话语更难以说出口。某个夜晚，雏田的妹妹花火（浅井清己配音）遭到不明身份之人劫持，带火的陨石则落在附近的山坡之上。为了救回花火，阻止地球毁灭，鸣人、雏田、小樱（中村千绘配音）、鹿丸（森久保祥太郎配音）和佐井奉命前去调查舍人（福山润配音）的真身。在此过程中，鸣人不小心知晓了雏田的心意……","cover":"http://api.pingcc.cn/video/img/火影忍者剧场版：终章/火影忍者剧场版：终章.jpg","releaseTime":"2014","updateTime":"2022-09-11"},{"videoId":"fa180503-8dbc-36eb-9094-4ccd36021133","title":"火影忍者剧场版：血狱","director":"村田雅彦","actor":"竹内顺子,中村千绘,小山力也,井上和彦,寺杣昌纪,园崎未惠,中村悠一,河西健吾,广田行生,胜生真沙子,森久保祥太郎,伊藤健太郎,鸟海浩辅,远近孝一,田村由香里,中博史,江川央生,手冢秀彰,夜野光,小松由佳,河本邦弘,关山美沙纪,星野充昭,佐藤忍,佐佐木省三,坂卷学,菊本平,远藤纯平,木岛隆一,松本忍,上川隆也","region":"日本","videoType":"日韩动漫,","descs":"　　在一段晦暗的日子里，云隐、雾隐和岩隐的忍者接连遭到神秘忍者的袭击，而从这些地方发来的通缉令全部指向了木叶村的漩涡鸣人（竹内顺子配音）。鸣人百口莫辩，最终被五花大绑，投入了“血狱”鬼灯城。鬼灯城地处大海中央的孤岛之上，四周波涛汹涌，怒浪滔天，小岛悬崖峭壁，地势险恶。此处囚禁着或罪大恶极或忠义至上的上忍，加上城主无为（寺杣昌纪配音）严酷的统治及严密防卫，鬼灯城堪称绝对无法逃脱的死地。即使明知不可为，鸣人也要想方设法从此地逃脱。在这一过程中，令他蒙受不白之冤的阴谋渐渐浮出水面……","cover":"http://api.pingcc.cn/video/img/火影忍者剧场版：血狱/火影忍者剧场版：血狱.jpg","releaseTime":"2011","updateTime":"2022-09-11"},{"videoId":"12e7f44f-fd85-3b79-a316-6dac9ce19c05","title":"火影忍者剧场版：博人传","director":"山下宏幸","actor":"三瓶由布子,菊池心,木岛隆一,竹内顺子,中村千绘,杉山纪彰,早见沙织,水树奈奈,小野贤章,森久保祥太郎,阿部敦,日野聪,高桥英则,田村由香里,增川洋一,石田彰,竹内良太,宫田幸季,武田华,浪川大辅,安元洋贵,江川央生,菊本平,河西健吾,河合海,竹内绚子,奥村翔,玄田哲章","region":"日本","videoType":"日韩动漫,","descs":"　　漩涡博人（三瓶由布子YukoSanpei配音）虽然是七代火影漩涡鸣人（竹内顺子配音）的儿子，但是他并不以父亲为荣，父子间充满了误会。博人为了打败父亲，准备拜师宇智波佐助（杉山纪彰配音），与此同时，博人与佐助的女儿佐良娜（菊池心配音）、三月（木岛隆一饰）组成了小队，共同参加下影的考试。下影考试开始，博人求胜心切，不料考试途中，神秘反派大筒木桃式、金式发动了突然袭击，鸣人为了保护木叶村陷入了危机。博人开始重新认识这个父亲，和佐助、我爱罗等父亲的老朋友开始了拯救鸣人的战斗。","cover":"http://api.pingcc.cn/video/img/火影忍者剧场版：博人传/火影忍者剧场版：博人传.jpg","releaseTime":"2015","updateTime":"2022-09-11"},{"videoId":"3f1ea752-e7a3-3e20-8999-cad451957804","title":"火影忍者舞台剧便服采访篇","director":"","actor":"","region":"日本","videoType":"","descs":"2.5次元舞台剧10月登陆中国","cover":"http://api.pingcc.cn/video/img/火影忍者舞台剧便服采访篇/火影忍者舞台剧便服采访篇.jpg","releaseTime":"2016","updateTime":"2022-05-05"},{"videoId":"43220d0f-8a40-3749-8092-77269b01e843","title":"火影忍者剧场版：忍者之路","director":"伊达勇登","actor":"竹内顺子,中村千绘,森川智之,筱原惠美,伊仓一惠,松本保典,井上和彦,江原正士,关俊彦,杉山纪彰,日野聪,森久保祥太郎,伊藤健太郎,柚木凉香,鸟海浩辅,水树奈奈,川田绅司,增川洋一,远近孝一,田村由香里,胜生真沙子,根本圭子,福田信昭,中村大树,藤生圣子,石川英郎,飞田展男,川本克彦,檀臣幸,寺杣昌纪,土师孝也,中博史,樱井敏治,朝仓荣介,松本忍,宫下典子,织部由香里,大塚芳忠,玄田哲章,内田直哉","region":"日本","videoType":"日韩动漫,","descs":"　　刚刚结束了与叛忍集团“晓”的抗争，木叶村被一股诡异不祥的气氛所笼罩。此时此刻，漩涡鸣人（竹内顺子配音）沉浸在对家人的思念中，孤独无助。某个晚上，心情糟糕的鸣人巧遇刚刚和家人吵架的小樱（中村千绘配音），二人在公园闲聊之际，神秘的斑（内田直哉配音）突然出现，并向二人使出瞳术。眩晕过后，鸣人和小樱发现看似一如平常的木叶村，曾经熟悉的伙伴竟然性格发生巨变。一连串不正常的事件令二人苦恼不已。更令人难以置信的是，包括佐助以及鸣人的父母波风水门（森川智之配音）和玖辛奈（篠原惠美配音）也出现在他们的面前。斑的阴谋慢慢展开……","cover":"http://api.pingcc.cn/video/img/火影忍者剧场版：忍者之路/火影忍者剧场版：忍者之路.jpg","releaseTime":"2012","updateTime":"2022-09-06"},{"videoId":"d514331c-b05e-3116-95e0-e13b4a9911ad","title":"火影忍者外传：李洛克的青春","director":"むらた　雅彦","actor":"ロック・リー：増川洋一,日向ネジ：遠近孝一,テンテン：田村ゆかり","region":"日本","videoType":"日韩动漫,","descs":"　　顾名思义，《李洛克的青春FULLPOWER忍传》是以《火影忍者》中的登场人物李洛克为主人公的派生漫画。熟悉《火影忍者》的粉丝都知道，李洛克是以国际功夫巨星李小龙(微博)为原型创作的人物，他既单纯又热血，一心想要成为一个优秀的忍者。但可惜的是，他身上既没有被笼罩上无敌的主角光环，也没有得天独厚的强大的忍术资质，幻术和忍术基本不会。但即使如此他也没有放弃梦想，反而用比别人多上几十倍的努力，刻苦修炼体术，经历一次次失败也不气馁，最终实现了理想，成为了一名优秀的忍者，被阿凯老师称赞为“努力的天才”。小李本身并非颜很好的偶像型角色，也不是强到逆天的BOSS级角色，但依旧凭借那坚韧不拔的毅力，为自己赢来了大批的忠实粉丝，如今终于在《火影忍者》的官方同人漫画里做起了主角。这本官方同人漫画正是讲述了努力的天才李洛克每天和同伴一起其乐融融的修炼生活，漫画推出后也受到了诸多粉丝的好评。","cover":"http://api.pingcc.cn/video/img/火影忍者外传：李洛克的青春/火影忍者外传：李洛克的青春.jpg","releaseTime":"2012","updateTime":"2022-09-09"},{"videoId":"054988f8-c4aa-3da7-a4e9-b420838b9ac3","title":"火影忍者疾风传剧场版：羁绊","director":"龟垣一","actor":"竹内顺子,中村千绘,杉山纪彰,石冢运升,熊井统子,井上和彦,小山力也,森久保祥太郎,水树奈奈,日野聪,川田绅司,伊藤健太郎,远近孝一,根本圭子,远藤纯一,藤吉浩二,兴津和幸,松本和香子,神奈延年,胜生真沙子,大塚芳忠","region":"日本","videoType":"日韩动漫,","descs":"　　某日，一群使用风遁之术的空忍空袭火之国，无数民众和忍者遇害，形势危急。据纲手大人所言，这群不速之客正是在第二次忍者大战中落败的空之团，如今他们怀着复仇之心再次出现。卡卡西（井上和彦配音）等人则负责侦查空之团的老巢，鸣人（竹内顺子配音）、小樱（中村千绘配音）、雏田（水樹奈々配音）受命组成三人医疗小队，协助名医神农（石塚運昇配音）前往其徒弟雨琉的家乡医治伤者。另一方面，病入膏肓的大蛇丸得知神农的再生之术业已完成，他命佐助（杉山纪彰配音）前去寻找神农。这也促成佐助和昔日伙伴宿命的重逢……","cover":"http://api.pingcc.cn/video/img/火影忍者疾风传剧场版：羁绊/火影忍者疾风传剧场版：羁绊.jpg","releaseTime":"2008","updateTime":"2022-09-11"},{"videoId":"0c8855f8-806e-3535-8f24-e93bac4a52f6","title":"火影忍者疾风传剧场版：鸣人之死","director":"龟垣一","actor":"竹内顺子,中村千绘,增川洋一,远近孝一,藤村步,藤田圭宣,岸尾大辅,折笠富美子,中村秀利,柿原彻也,谷山纪章,泽城美雪,小西克幸,胜生真沙子,根本圭子,江原正士,井上和彦,森久保祥太郎,朴璐美,小野大辅,千千和龙策,峰健一,藤井启辅,西野阳子,锅井真纪子,安齐一博,木村拓,栉田泰道,石上裕一,远藤大辅,增田隆之,松尾大亮,石川静,加藤精三","region":"日本","videoType":"日韩动漫,","descs":"　　幽灵军团的黄泉（中村秀利配音）通过神秘的暗黑医疗术，复活了具有足以毁灭世界恐怖力量的魔物魍魉（加藤精三配音），希望以此建立黑暗的千年王国。魍魉俯身于黄泉身上，随即命令幽灵军团攻打鬼之国，企图杀害具有封印魔物和预言死亡能力的巫女紫苑（藤村歩配音），并准备夺回魍魉封印在沼之国的肉体。一旦魍魉的灵魂和肉体合二为一，世界将彻底灭亡。鬼之国遇袭的消息很快传到其他各国，叶隐村的忍者也被调动起来。鸣人（竹内顺子配音）、小樱（中村千绘配音）、宁次（遠近孝一配音）和小李（増川洋一配音）受命前去保护紫苑。然而，鸣人却从紫苑的口中得到他将死去的预言……","cover":"http://api.pingcc.cn/video/img/火影忍者疾风传剧场版：鸣人之死/火影忍者疾风传剧场版：鸣人之死.jpg","releaseTime":"2007","updateTime":"2022-09-11"},{"videoId":"f9f41649-ad73-3e77-9c13-de2c04756066","title":"火影忍者：博人传之次世代继承者","director":"阿部记之,山下宏幸","actor":"三瓶由布子,菊池心,木岛隆一,小野贤章,阿部敦,早见沙织","region":"日本","videoType":"日韩动漫,","descs":"　　随着和平的到来而走向近代化的木叶忍者村。高楼林立，巨大显示屏中播放出影像，连结各区域的电车在村里奔驰。虽说是忍者村，但一般民众也增多，忍者的生存方式也在逐渐改变的这个时代——","cover":"http://api.pingcc.cn/video/img/火影忍者：博人传之次世代继承者/火影忍者：博人传之次世代继承者.jpg","releaseTime":"2017","updateTime":"2023-04-30"},{"videoId":"edd33843-c2d9-3e3d-8fb7-ca56a3ba0475","title":"火影忍者疾风传剧场版：失落之塔","director":"村田雅彦","actor":"竹内顺子,中村千绘,日野聪,小山力也,福田信昭,滨田贤二,根本圭子,早见沙织,冬马由美,小林优子,泷本富士子,田村睦心,牧口真幸,岩崎了,远藤大智,高桥英则,大友龙三郎,胜生真沙子,大塚芳忠,柴田秀胜,森川智之","region":"日本","videoType":"日韩动漫,","descs":"　　为了追踪叛忍百足，五代目火影网手（胜生真沙子配音）命令大和（小山力也配音）率领小樱（中村千絵配音）、漩涡鸣人（竹内顺子配音）、佐井（日野聪配音）等人前往楼兰。楼兰某处地下藏有蕴含巨大能量的龙脉查克拉，很久以前被第四代火影封印。而百足的目标则是解开封印，释放恐怖的力量。经过千钧一发的搏斗，鸣人变成孤身一人，他意外来到一座繁华的失落城市，在此遭到了傀儡部队的袭击，并得到神秘木叶忍者的救助。之后鸣人邂逅楼兰女王萨拉，而围绕这个美丽的女子，邪恶的阴谋正悄悄展开。时空错乱，旧日的影像浮现……","cover":"http://api.pingcc.cn/video/img/火影忍者疾风传剧场版：失落之塔/火影忍者疾风传剧场版：失落之塔.jpg","releaseTime":"2010","updateTime":"2022-09-11"},{"videoId":"19e00d46-f045-3c90-8db0-75f8a4120e35","title":"火影忍者舞台剧虹桥艺术中心采访篇","director":"","actor":"","region":"日本","videoType":"","descs":"2.5次元舞台剧10月登陆中国","cover":"http://api.pingcc.cn/video/img/火影忍者舞台剧虹桥艺术中心采访篇/火影忍者舞台剧虹桥艺术中心采访篇.jpg","releaseTime":"2017","updateTime":"2022-05-05"},{"videoId":"d20e8687-2cc1-31ff-9863-5dfb30bb5d27","title":"火影忍者剧场版：大活剧！雪姬忍法帖！","director":"冈村天斋","actor":"竹内顺子,杉山纪彰,中村千绘,井上和彦,甲斐田裕子,矶部勉,铃置洋孝,唐泽润,金子力,西川几雄,高濑右光,宝龟克寿,仲野裕,古泽彻,田中完,渡边英雄,高阶俊嗣,细野雅世,重松朋,大塚周夫,石冢英彦,美山加恋","region":"日本","videoType":"日韩动漫,","descs":"　　影院正在上映奇侠电影《风云公主大冒险》，鸣人（竹内顺子配音）情不自禁大声喧哗，结果连同波佐助（杉山纪彰配音）、小樱（中村千绘配音）一同被赶出电影院。正当鸣人望着电影海报发呆时，竟发现风云公主骑着快马从身边呼啸而过，其身后另有数名骑马的追兵。三人未作迟疑，起身相助。结果从卡卡西口中得知，追兵的头目竟是此次任务的委托人，逃跑的风云公主则是影片的女主角富士风雪绘。原来《风云公主大冒险》的结局将在雪之国，可当雪绘听说这个名字后经落荒而逃，卡卡西他们的任务正是担当雪绘的护卫。似乎，在雪绘和雪之国之间，隐藏着不为人知的秘密……","cover":"http://api.pingcc.cn/video/img/火影忍者剧场版：大活剧！雪姬忍法帖！/火影忍者剧场版：大活剧！雪姬忍法帖！.jpg","releaseTime":"2004","updateTime":"2022-09-11"},{"videoId":"e60040bb-e473-3968-9f80-cfde30817a57","title":"火影忍者剧场版：大激突！幻之地底遗迹","director":"川崎博嗣","actor":"竹内顺子,河相我闻,中村千绘,森久保祥太郎,石田彰,加濑康之,高乃丽,小岛幸子,桑岛法子,本田贵子,加藤优子,志村知幸,宫岛史年,吉野贵宏,加藤将之,酒井敬幸,黑川智花,野岛昭生,野泽那智","region":"日本","videoType":"日韩动漫,","descs":"　　鸣人（竹内顺子配音）、小樱（中村千绘配音）和鹿丸三人进入深山寻找走失的雪貂，在回来的路上，他们遭到全副武装的骑士团的袭击。在激烈的对抗中，鸣人和对方的白甲头目特穆金一同跌落悬崖，两人被刚巧路过的商队所救。一路上，两个对手慢慢开始了解，继而得知特穆金要建立一个没有战争和灾难的乌托邦，而鸣人具有的神奇力量正是他们所需要的。与此同时，鹿丸则和小樱目击到一个巨型堡垒，他们发现堡垒四周满是穿着铠甲的武士。鹿丸偷偷潜入侦查，看见一群被禁锢在容器中的小孩，并听到关于吉鲁遗产的谈话。这与特穆金之间究竟有什么样的关联？","cover":"http://api.pingcc.cn/video/img/火影忍者剧场版：大激突！幻之地底遗迹/火影忍者剧场版：大激突！幻之地底遗迹.jpg","releaseTime":"2005","updateTime":"2022-09-11"},{"videoId":"06a7caf4-3021-3c13-8f1f-c0ea788eee6e","title":"火影忍者-博人传-次世代继承者[电影解说]","director":"阿部记之,山下宏幸","actor":"三瓶由布子,菊池心,木岛隆一,小野贤章,阿部敦,早见沙织","region":"日本","videoType":"电影解说,","descs":"　　随着和平的到来而走向近代化的木叶忍者村。高楼林立，巨大显示屏中播放出影像，连结各区域的电车在村里奔驰。虽说是忍者村，但一般民众也增多，忍者的生存方式也在逐渐改变的这个时代——","cover":"http://api.pingcc.cn/video/img/火影忍者-博人传-次世代继承者[电影解说]/火影忍者-博人传-次世代继承者[电影解说].jpg","releaseTime":"2017","updateTime":"2023-06-26"},{"videoId":"438033ac-42a7-3133-bcd4-3cfd6be229b6","title":"火影忍者疾风传剧场版：火之意志的继承者","director":"村田雅彦","actor":"竹内顺子,中村千绘,日野聪,森久保祥太郎,伊藤健太郎,柚木凉香,鸟海浩辅,水树奈奈,川田绅司,增川洋一,远近孝一,田村由香里,石田彰,加濑康之,朴璐美,保志总一朗,下山吉光,皆川纯子,渡边英雄,大塚芳忠,胜生真沙子,根本圭子,河野智之,坪井智浩,朝仓荣介,柴田秀胜,小杉十郎太,杉山纪彰,小森创介,七绪春日,铃森勘司,井上和彦","region":"日本","videoType":"日韩动漫,","descs":"　　为追踪4名血继限界继承者的下落，小樱（中村千絵配音）、漩涡鸣人（竹内顺子配音）、卡卡西（井上和彦配音）和佐井奉命前往。但在岩隐和草隐交界的须弥山失去目标，鸣人和佐井也身受重伤。在此之后，自称卑留呼（保志総一朗配音）的前木叶村忍者单方面宣战，他之前因修习鬼芽罗术而被逐出木叶，而今他企图集齐5个血继限界成为不死的完美忍者，进而发起第四次忍界大战。在此危急时刻，卡卡西感受到来自卑留呼的召唤。失去最重要的导师，鸣人、木叶村乃至忍者诸国面临前所未有的挑战……","cover":"http://api.pingcc.cn/video/img/火影忍者疾风传剧场版：火之意志的继承者/火影忍者疾风传剧场版：火之意志的继承者.jpg","releaseTime":"2009","updateTime":"2022-09-11"},{"videoId":"b44e1965-f518-3827-8520-a82eb9803884","title":"火影忍者剧场版：大兴奋！三日月岛的动物骚动","director":"都留稔幸","actor":"竹内顺子,中村千绘,增川洋一,井上和彦,大塚明夫,池田恭祐,林真里花,佐佐木梅治,菅原正志,江川央生,七绪春日,滨田贤二,宗矢树赖,加藤将之,松本大,铃木圭悟,西村知道,滨口平吾,滨口京子,松本康太,西川晃启,柳泽荣治,船木真人,木川绘理子,须部和佳奈,纳谷六朗,胜生真沙子","region":"日本","videoType":"日韩动漫,","descs":"　　鸣人（竹内顺子配音）、小樱（中村千绘配音）、卡卡西（井上和彦配音）和小李（増川洋一配音）四人接到新的任务，他们要护送月之国王子月满回国。月之国位于三日月岛，该国超级富有，他们的王子月满则俨然一个纨绔子弟的形象。受父王之命，月满带着儿子小光及众多随从周游列国，沿途买了无数的东西。所谓树大招风，不少歹徒打起月之国一行的主意。作为清贫的忍者，他们无法理解富人的一些做法。不过随着旅途的积蓄，鸣人他们渐渐了触摸到月满父子的内心世界，彼此间成为很好的朋友。漫长的旅行仍在继续，更多的艰难险阻等在前方……","cover":"http://api.pingcc.cn/video/img/火影忍者剧场版：大兴奋！三日月岛的动物骚动/火影忍者剧场版：大兴奋！三日月岛的动物骚动.jpg","releaseTime":"2006","updateTime":"2022-09-11"}]

class VideoEntity {
  VideoEntity({
      String? msg, 
      num? code, 
      num? count, 
      List<Data>? data,}){
    _msg = msg;
    _code = code;
    _count = count;
    _data = data;
}

  VideoEntity.fromJson(dynamic json) {
    _msg = json['msg'];
    _code = json['code'];
    _count = json['count'];
    if (json['data'] != null) {
      _data = [];
      json['data'].forEach((v) {
        _data?.add(Data.fromJson(v));
      });
    }
  }
  String? _msg;
  num? _code;
  num? _count;
  List<Data>? _data;
VideoEntity copyWith({  String? msg,
  num? code,
  num? count,
  List<Data>? data,
}) => VideoEntity(  msg: msg ?? _msg,
  code: code ?? _code,
  count: count ?? _count,
  data: data ?? _data,
);
  String? get msg => _msg;
  num? get code => _code;
  num? get count => _count;
  List<Data>? get data => _data;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['msg'] = _msg;
    map['code'] = _code;
    map['count'] = _count;
    if (_data != null) {
      map['data'] = _data?.map((v) => v.toJson()).toList();
    }
    return map;
  }

}

/// videoId : "05b4529c-661d-363f-9ff1-51cf551080cd"
/// title : "火影忍者"
/// director : "伊达勇登,村田雅彦,都留稔幸,若林厚史,小坂春女,川口敬一郎"
/// actor : "竹内顺子,杉山纪彰,中村千绘,井上和彦,关俊彦,松本和香子,大塚芳忠,胜生真沙子,柴田秀胜,森久保祥太郎,伊藤健太郎,柚木凉香,小杉十郎太,增川洋一,远近孝一,田村由香里,江原正士,水树奈奈,鸟海浩辅,川田绅司,落合露美,大谷育江,重松朋,下屋则子,飞田展男,石冢运升,浅野真由美,石田彰,加濑康之,朴璐美,中田让治,保志总一朗,神奈延年,三木真一郎,中村大树,家中宏,福田信昭,楠大典,本田贵子,平田广明,津田健次郎,坪井智浩,河野智之,根本圭子,铃木琢磨,小林由美子,津田英三,伊藤和晃,浅井清己,佐佐木望"
/// region : "日本"
/// videoType : "日韩动漫,"
/// descs : "　　十多年前一只拥有巨大威力的妖兽“九尾妖狐”袭击了木叶忍者村，当时的第四代火影拼尽全力，以自己的生命为代价将“九尾妖狐”封印在了刚出生的鸣人身上。木叶村终于恢复了平静，但村民们却把鸣人当成像“九尾妖狐”那样的怪物看待，所有人都疏远他。鸣人自小就孤苦无依，一晃十多年过去了，少年鸣人考入了木叶村的忍者学校，结识了好朋友佐助和小樱。佐助是宇智波家族的传人之一，当他还是小孩的时候他的哥哥——一个已经拥有高超忍术的忍者将他们家族的人都杀死了，然后投靠了一直想将木叶村毁灭的大蛇丸，佐助自小就发誓要超越哥哥，为家族报仇。鸣人他们在忍者学校得到了教官卡卡西的精心指点，在他的帮助下去迎接成长中的一次又一次挑战！"
/// cover : "http://api.pingcc.cn/video/img/火影忍者/火影忍者.jpg"
/// releaseTime : "2002"
/// updateTime : "2022-08-20"

class Data {
  Data({
      String? videoId, 
      String? title, 
      String? director, 
      String? actor, 
      String? region, 
      String? videoType, 
      String? descs, 
      String? cover, 
      String? releaseTime, 
      String? updateTime,}){
    _videoId = videoId;
    _title = title;
    _director = director;
    _actor = actor;
    _region = region;
    _videoType = videoType;
    _descs = descs;
    _cover = cover;
    _releaseTime = releaseTime;
    _updateTime = updateTime;
}

  Data.fromJson(dynamic json) {
    _videoId = json['videoId'];
    _title = json['title'];
    _director = json['director'];
    _actor = json['actor'];
    _region = json['region'];
    _videoType = json['videoType'];
    _descs = json['descs'];
    _cover = json['cover'];
    _releaseTime = json['releaseTime'];
    _updateTime = json['updateTime'];
  }
  String? _videoId;
  String? _title;
  String? _director;
  String? _actor;
  String? _region;
  String? _videoType;
  String? _descs;
  String? _cover;
  String? _releaseTime;
  String? _updateTime;
Data copyWith({  String? videoId,
  String? title,
  String? director,
  String? actor,
  String? region,
  String? videoType,
  String? descs,
  String? cover,
  String? releaseTime,
  String? updateTime,
}) => Data(  videoId: videoId ?? _videoId,
  title: title ?? _title,
  director: director ?? _director,
  actor: actor ?? _actor,
  region: region ?? _region,
  videoType: videoType ?? _videoType,
  descs: descs ?? _descs,
  cover: cover ?? _cover,
  releaseTime: releaseTime ?? _releaseTime,
  updateTime: updateTime ?? _updateTime,
);
  String? get videoId => _videoId;
  String? get title => _title;
  String? get director => _director;
  String? get actor => _actor;
  String? get region => _region;
  String? get videoType => _videoType;
  String? get descs => _descs;
  String? get cover => _cover;
  String? get releaseTime => _releaseTime;
  String? get updateTime => _updateTime;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['videoId'] = _videoId;
    map['title'] = _title;
    map['director'] = _director;
    map['actor'] = _actor;
    map['region'] = _region;
    map['videoType'] = _videoType;
    map['descs'] = _descs;
    map['cover'] = _cover;
    map['releaseTime'] = _releaseTime;
    map['updateTime'] = _updateTime;
    return map;
  }

}